import 'package:flutter/material.dart';
import 'package:sharikiapp/utilities/styles/constant_styles.dart';

class TermsAndConditions extends StatelessWidget {
  const TermsAndConditions({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SingleChildScrollView(
      child: Container(
        padding: EdgeInsets.all(10),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            text("الشروط والأحكام", 18, FontWeight.bold),
            text("أهلا بك في تطبيق شريكي٫ نهدف لتوفير منصة تساعد المشاريع الناشئة على ايجاد شركاء مناسبين لهم وتوفير فرص للأفراد الشغوفين لإحداث تغيير في المشاريع", 14, FontWeight.normal),
            SizedBox(height: 20),
            text("هذه اللائحة ستكون فعالة في تاريخ 18 سبتمبر 2022.", 14, FontWeight.normal),
            SizedBox(height: 10),
            text("باستخدامك تطبيق شريكي٫ فآنت توافق على الشروط والأحكام أدناه.", 14, FontWeight.normal),
            SizedBox(height: 10),
            text("الشروط الأساسية", 14, FontWeight.bold),
            text("1. يجب أن يكون عمرك 14 سنة أو أكثر لاستخدام التطبيق.", 14, FontWeight.normal),
            text("2. أنت مسؤول عن أي نشاط يحدث من خلالك.", 14, FontWeight.normal),
            text("3. أنت مسؤول عن الحفاظ على أمان كلمة المرور الخاصة بك.", 14, FontWeight.normal),
            text("4. لا يجوز لك إساءة استخدام مستخدمي تطبيق شريكي الآخرين أو مضايقتهم أو تهديدهم أو انتحال صفتهم أو تخويفهم.", 14, FontWeight.normal),
            text("5. لا يجوز لك استخدام تطبيق شريكي لأي غرض غير قانوني أو غير مصرح به. يوافق المستخدمون الدوليون على الامتثال لجميع القوانين المحلية المتعلقة بالسلوك عبر الإنترنت والمحتوى المقبول.", 14, FontWeight.normal),
            text("6. أنت وحدك المسؤول عن سلوكك وأي بيانات ونصوص ومعلومات وأسماء شاشة ورسومات وصور وملفات تعريف ومقاطع صوت وفيديو وروابط ترسلها وتنشرها وتعرضها على تطبيق شريكي.", 14, FontWeight.normal),
            text("7. لا يجوز لك تعديل موقع شريكي أو تكييفه أو اختراقه أو تعديل موقع ويب آخر للإيحاء خطأً أنه مرتبط بـ شريكي.", 14, FontWeight.normal),
            text("8. يجب عدم الوصول إلى واجهة برمجة التطبيقات الخاصة بـ شريكي بأي وسيلة أخرى بخلاف تطبيق شريكي نفسه.", 14, FontWeight.normal),
            text("9. لا يجوز لك كشط أو تخزين أي محتوى من شريكي بما في ذلك على سبيل المثال لا الحصر ملفات تعريف المستخدمين والصور.", 14, FontWeight.normal),
            text("10. يجب عدم إنشاء أو إرسال بريد إلكتروني أو تعليقات غير مرغوب فيها إلى أي من أعضاء تطبيق شريكي.", 14, FontWeight.normal),
            text("11. لا يجوز لك نقل أي فيروسات أو فيروسات متنقلة أو أي رمز ذي طبيعة مدمرة.", 14, FontWeight.normal),
            text("12. لا يجوز لك ، عند استخدام شريكي ، انتهاك أي قوانين في نطاق سلطتك (بما في ذلك على سبيل المثال لا الحصر قوانين حقوق النشر).", 14, FontWeight.normal),
            text("13. سيؤدي انتهاك أي من هذه الاتفاقيات إلى إنهاء الحساب الخاص بك في التطبيق. بينما نحظر مثل هذا السلوك والمحتوى على موقعها ، فإنك تدرك وتوافق على أن شريكي لا يمكن أن يكون مسؤولاً عن المحتوى المنشور على موقع الويب الخاص به ، ومع ذلك قد تتعرض لمثل هذه المواد وأنك تستخدم تطبيق شريكي على مسؤوليتك الخاصة.", 14, FontWeight.normal),
            SizedBox(height: 10),
            text("الشروط العامة", 14, FontWeight.bold),
            text("1. نحتفظ بالحق في تعديل أو إنهاء خدمة تطبيق شريكي لأي سبب ، دون سابق إنذار في أي وقت.", 14, FontWeight.normal),
            text("2. نحتفظ بالحق في تغيير شروط الاستخدام هذه في أي وقت. إذا كانت التعديلات تشكل تغييرًا جوهريًا في شروط الاستخدام ، فسنخطرك عبر البريد الإلكتروني وفقًا للتفضيل المعبر عنه في حسابك. سيتم تحديد ما يشكل تغييرًا ماديًا وفقًا لتقديرنا الخاص ، وبحسن نية وباستخدام الفطرة السليمة والحكم المعقول.", 14, FontWeight.normal),
            text("3. نحتفظ بالحق في رفض الخدمة لأي شخص لأي سبب وفي أي وقت.", 14, FontWeight.normal),
            text("4. نحتفظ بالحق في فرض مصادرة أي اسم مستخدم يصبح غير نشط أو ينتهك العلامة التجارية أو قد يضلل المستخدمين الآخرين.", 14, FontWeight.normal),
            text("5. يجوز لنا ، ولكن ليس لدينا أي التزام ، إزالة المحتوى والحسابات التي تحتوي على محتوى نحدده وفقًا لتقديرنا الخاص بأنها غير قانونية أو مسيئة أو مهددة أو تشهيرية أو تشهيرية أو فاحشة أو مرفوضة أو تنتهك الملكية الفكرية لأي طرف أو شروط الاستخدام هذه .", 14, FontWeight.normal),
            text("6. نحتفظ بالحق في استعادة أسماء المستخدمين نيابة عن الشركات أو الأفراد الذين لديهم مطالبة قانونية أو علامة تجارية على أسماء المستخدمين هذه.", 14, FontWeight.normal),
            text("7. لدينا الحق في استخدام البيانات التي لدينا عن جميع المستخدمين بما في ذلك جميع محتوى تطبيق شريكي بطريقة لتحسين خدمات التطبيق الشاملة.", 14, FontWeight.normal),

            
          ],
        ),
      ),
    );
  }
}

Widget text(String text, double size, FontWeight weight) {
  return Text(
    text,
    textAlign: TextAlign.start,
    style: TextStyle(fontSize: size, fontWeight: weight, color: textColor),
  );
}
